# Pandas Advance Assignment

## Q1. List any five functions of the pandas library with execution.

- read_csv(): This function is used to read a CSV file into a Pandas DataFrame.
####
- head(): This function is used to display the first few rows of a Pandas DataFrame.
####
- tail(): This function is used to display the last few rows of a Pandas DataFrame.
####
- drop(): This function is used to remove any specific rows or column of a Pandas DataFrame.
####
- rename(): This function is used to rename a column of a Pandas DataFrame.

In [104]:
import pandas as pd

data = (["Alice", 25, "female"], [
    "Bob", 30, "Female"],
    ["Claire", 27, "Female"])
df = pd.DataFrame(data, columns=["Name", "Age", "gender"])

In [105]:
#read_csv()
import pandas as pd

df = pd.read_csv('services.csv')

In [106]:
#head()
import pandas as pd

df = pd.read_csv('services.csv')

df.head(2)

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
0,1,1,NaN,NaN,NaN,Walk in or apply by phone.,"Older adults age 55 or over, ethnic minorities...",A walk-in center for older adults that provide...,"Age 55 or over for most programs, age 60 or ov...",NaN,...,NaN,"ADULT PROTECTION AND CARE SERVICES, Meal Sites...",NaN,Fair Oaks Adult Activity Center,NaN,Colma,active,No wait.,NaN,NaN
1,2,2,NaN,NaN,NaN,Apply by phone for an appointment.,Residents of San Mateo County age 55 or over,Provides training and job placement to eligibl...,"Age 55 or over, county resident and willing an...",NaN,...,NaN,"EMPLOYMENT/TRAINING SERVICES, Job Development,...",NaN,Second Career Employment Program,NaN,San Mateo County,active,Varies.,NaN,NaN

In [107]:
#tail()
import pandas as pd

df = pd.read_csv('services.csv')

df.tail(2)

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
21,22,22,NaN,"Cash, Check, Credit Card",Fotos para pasaportes,Walk in or apply by phone or mail,"Profit and nonprofit businesses, the public, m...",[NOTE THIS IS NOT A REAL SERVICE--THIS IS FOR ...,None,passports@example.org,...,We offer 3-way interpretation services over th...,"Salud, Medicina",Spanish,Passport Photos,Government-issued picture identification,"Alameda County, San Mateo County",active,No wait to 2 weeks.,http://www.example.com,"105, 108, 108-05, 108-05-01, 111, 111-05"
22,23,22,NaN,NaN,NaN,Walk in or apply by phone or mail,"Second service and nonprofit businesses, the p...",[NOTE THIS IS NOT A REAL ORGANIZATION--THIS IS...,None,NaN,...,NaN,"Ruby on Rails/Postgres/Redis, testing, wic",NaN,Example Service Name,NaN,"San Mateo County, Alameda County",active,No wait to 2 weeks,http://www.example.com,NaN

In [108]:
#df.drop(column)
df_drop = df.drop('program_id', axis=1)
df_drop.head(2)

,id,location_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,fees,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
0,1,1,NaN,NaN,Walk in or apply by phone.,"Older adults age 55 or over, ethnic minorities...",A walk-in center for older adults that provide...,"Age 55 or over for most programs, age 60 or ov...",NaN,$2.50 suggested donation for lunch for age 60 ...,...,NaN,"ADULT PROTECTION AND CARE SERVICES, Meal Sites...",NaN,Fair Oaks Adult Activity Center,NaN,Colma,active,No wait.,NaN,NaN
1,2,2,NaN,NaN,Apply by phone for an appointment.,Residents of San Mateo County age 55 or over,Provides training and job placement to eligibl...,"Age 55 or over, county resident and willing an...",NaN,None. Donations requested of clients who can a...,...,NaN,"EMPLOYMENT/TRAINING SERVICES, Job Development,...",NaN,Second Career Employment Program,NaN,San Mateo County,active,Varies.,NaN,NaN

In [109]:
#rename
df_rename = df.rename(columns={'alternate_name': 'Name'})
df_rename.head(2)

,id,location_id,program_id,accepted_payments,Name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
0,1,1,NaN,NaN,NaN,Walk in or apply by phone.,"Older adults age 55 or over, ethnic minorities...",A walk-in center for older adults that provide...,"Age 55 or over for most programs, age 60 or ov...",NaN,...,NaN,"ADULT PROTECTION AND CARE SERVICES, Meal Sites...",NaN,Fair Oaks Adult Activity Center,NaN,Colma,active,No wait.,NaN,NaN
1,2,2,NaN,NaN,NaN,Apply by phone for an appointment.,Residents of San Mateo County age 55 or over,Provides training and job placement to eligibl...,"Age 55 or over, county resident and willing an...",NaN,...,NaN,"EMPLOYMENT/TRAINING SERVICES, Job Development,...",NaN,Second Career Employment Program,NaN,San Mateo County,active,Varies.,NaN,NaN

## Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [110]:
import pandas as pd

data = {
    'A':['Ankit','Aman','Akash'],
    'B':['Mukul','Nakul','Naman'],
    'C':['Neil','Nitin','Mukesh'],}

df = pd.DataFrame(data)
print(df)

       A      B       C
0  Ankit  Mukul    Neil
1   Aman  Nakul   Nitin
2  Akash  Naman  Mukesh

In [111]:
df.index = [i for i in range(1, 2*len(df), 2)]
df

       A      B       C
1  Ankit  Mukul    Neil
3   Aman  Nakul   Nitin
5  Akash  Naman  Mukesh

## Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

- For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
  calculate and print the sum of the first three values, which is 60.

In [112]:
data = {'Values':[10,20,30,40,50]}
df = pd.DataFrame(data)

In [113]:
sum = 0
for i in range(3):
    sum += df[['Values']].values[i]
print(int(sum))

60

## Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [114]:
data = {'Text': 
        ["Given a Pandas DataFrame df with a column 'Text'",
        "Write a Python function to create a new column 'Word_Count'",
        "That contains the number of words in each row of the 'Text' column"]
       }
df = pd.DataFrame(data)

In [115]:
words = df['Text'].str.count(' ') + 1
df['Word_Count'] = words
df

                                                Text  Word_Count
0   Given a Pandas DataFrame df with a column 'Text'           9
1  Write a Python function to create a new column...          10
2  That contains the number of words in each row ...          13

## Q5. How are DataFrame.size() and DataFrame.shape() different?

- df.size:
    - Returns to total number of elements in the dataframe/series.
    - returns rows x columns.
####
- df.shape:
    - Returns no of (Rows, columns) of dataframe/series.
####
- Let's understand with the following example

In [116]:
data = {
    'A':['Ankit','Aman','Akash'],
    'B':['Mukul','Nakul','Naman'],
    'C':['Neil','Nitin','Mukesh'],}

df = pd.DataFrame(data)

In [117]:
df

       A      B       C
0  Ankit  Mukul    Neil
1   Aman  Nakul   Nitin
2  Akash  Naman  Mukesh

In [118]:
df.size

9

In [119]:
df.shape

(3, 3)

## Q6. Which function of pandas do we use to read an excel file?

- we use "pandas.read_excel('file_name.xlsx', sheet_name='sheet_name')" function to read an excel file.

## Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.
#### The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [120]:
data = {'Email': ['mukul@gmail.com', 'krish@gmail.com', 'sudh@gmail.com', 'aman@gmail.com']}
df = pd.DataFrame(data)

In [121]:
words = df['Email'].str.split('@').str[0]
df['Username'] = words
df

             Email Username
0  mukul@gmail.com    mukul
1  krish@gmail.com    krish
2   sudh@gmail.com     sudh
3   aman@gmail.com     aman

## Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows. For example, if df contains the following values:
#### -   A   B   C
#### 0   3   5   1
#### 1   8   2   7
#### 2   6   9   4
#### 3   2   3   5
#### 4   9   1   2

#### Your function should select the following rows:
#### -   A   B   C 
#### 1   8   2   7
#### 2   6   9   4
#### 4   9   1   2
#### The function should return a new DataFrame that contains only the selected rows.

In [137]:
data = (
    [3,5,1],
    [8,2,7],
    [6,9,4],
    [2,3,5],
    [9,1,2]
)

df = pd.DataFrame(data, columns=['A', 'B', 'C'])

In [138]:
new_df = df.loc[(df['A'] > 5) & (df['B'] < 10)]
new_df

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

## Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [124]:
data = {'Values':
        [30,20,30,40,50,90,70,80]
       }
df = pd.DataFrame(data)
df

   Values
0      30
1      20
2      30
3      40
4      50
5      90
6      70
7      80

In [125]:
df_mean = df.mean()
df_median = df.median()
df_std = df.std()

In [126]:
df_mean

Values    51.25
dtype: float64

In [127]:
df_median

Values    45.0
dtype: float64

In [128]:
df_std

Values    25.877458
dtype: float64

## Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [129]:
data = {
    'Date': ['01-04-2023', '02-04-2023', '03-04-2023', '04-04-2023', '05-04-2023', '06-04-2023', '07-04-2023', '08-04-2023', '09-04-2023', '10-04-2023', '11-04-2023', '12-04-2023'],
    'Sales': [550, 570, 540, 610, 480, 560, 510, 650, 630, 580, 510, 490]
}
df = pd.DataFrame(data)
df

          Date  Sales
0   01-04-2023    550
1   02-04-2023    570
2   03-04-2023    540
3   04-04-2023    610
4   05-04-2023    480
5   06-04-2023    560
6   07-04-2023    510
7   08-04-2023    650
8   09-04-2023    630
9   10-04-2023    580
10  11-04-2023    510
11  12-04-2023    490

In [130]:
df['Moving_Average'] = df.iloc[:,1].rolling(window=7).mean()
df

          Date  Sales  Moving_Average
0   01-04-2023    550             NaN
1   02-04-2023    570             NaN
2   03-04-2023    540             NaN
3   04-04-2023    610             NaN
4   05-04-2023    480             NaN
5   06-04-2023    560             NaN
6   07-04-2023    510      545.714286
7   08-04-2023    650      560.000000
8   09-04-2023    630      568.571429
9   10-04-2023    580      574.285714
10  11-04-2023    510      560.000000
11  12-04-2023    490      561.428571

## Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column. For example, if df contains the following values:
#### -  Date
#### 0  2023-01-01
#### 1  2023-01-02
#### 2  2023-01-03
#### 3  2023-01-04 
#### 4  2023-01-05
#### Your function should create the following DataFrame:
#### -       Date           Weekday
#### 0       2023-01-01     Sunday
#### 1       2023-01-02     Monday
#### 2       2023-01-03     Tuesday
#### 3       2023-01-04     Wednesday
#### 4       2023-01-05     Thursday
#### The function should return the modified DataFrame.

In [131]:
data = {'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']}
df = pd.DataFrame(data)
df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [132]:
df['Date'] = pd.to_datetime(df["Date"])
df['day_of_week'] = df["Date"].dt.day_name()
df

        Date day_of_week
0 2023-01-01      Sunday
1 2023-01-02      Monday
2 2023-01-03     Tuesday
3 2023-01-04   Wednesday
4 2023-01-05    Thursday

## Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [133]:
data = {'Date': ['2023-01-01', '2023-01-20', '2023-01-25', '2023-02-04', '2023-01-05']}
df = pd.DataFrame(data)

In [134]:
new_df = df.loc[(df['Date'] > '2023-01-01') & (df['Date'] < '2023-01-31')]
new_df

         Date
1  2023-01-20
2  2023-01-25
4  2023-01-05

## Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

- To use the basic pandas functions we need to import pandas libary with the following syntax:
    - import pandas as pd
####
- Pandas is built on top of two core Python librariesâ€”matplotlib for data visualization and NumPy for mathematical operations. Pandas acts as a wrapper over these libraries, allowing you to access many of matplotlib's and NumPy's methods with less code.